[
    {
        "name": "Nike",
        "country": "USA",
        "year_founded": 1964,
        "description": "Nike, Inc. is one of the world's leading sportswear and athletic brands, known for its footwear, apparel, and equipment. Founded in 1964 as Blue Ribbon Sports by Bill Bowerman and Phil Knight, it officially became Nike, Inc. in 1971, named after the Greek goddess of victory. Its iconic Swoosh logo and \"Just Do It\" slogan are among the most recognizable branding elements globally.\nHeadquartered in Beaverton, Oregon, Nike designs, develops, and markets products for a wide range of sports and active lifestyles. The company dominates the athletic footwear market with popular lines like Air Max, Air Jordan (in partnership with Michael Jordan), and Nike Dunk, while also offering performance and casual apparel.\nNike has built a powerful brand through high-profile endorsements with athletes and sports teams worldwide. It sponsors top athletes across basketball, soccer, running, and other sports, contributing to its cultural influence beyond just sportswear. The company also owns subsidiaries like Converse and has previously owned brands like Hurley.\nOver the years, Nike has faced criticism for labor practices but has made commitments to sustainability and corporate responsibility. Today, it continues to lead the global sportswear market through innovation, marketing, and its extensive retail and online presence."
    },
    {
        "name": "Adidas",
        "country": "Germany",
        "year_founded": 1949,
        "description": "Adidas AG is a global leader in sportswear, known for its footwear, apparel, and accessories. Founded in 1949 by Adolf \"Adi\" Dassler in Herzogenaurach, Germany, Adidas grew from a family-run business into one of the most recognized sports brands worldwide. Its signature three-stripe logo and the Trefoil mark are iconic in both sports and streetwear culture.\nAdidas designs products for a wide range of sports including soccer, running, basketball, and tennis. It is especially dominant in soccer, providing kits for top national teams and clubs, and producing the official ball for FIFA World Cup tournaments. Popular shoe lines include the Ultraboost, Stan Smith, Samba, and Superstar, as well as the Yeezy collaboration with Kanye West, which contributed significantly to its lifestyle market presence before the partnership ended in 2022.\nThe company emphasizes innovation through technologies like Boost cushioning and Primeknit materials, and it has increased its focus on sustainability with recycled materials and eco-friendly manufacturing initiatives.\nAdidas operates globally, competing closely with Nike and other major sportswear brands. It owns subsidiaries such as Reebok (which it sold in 2021) and continues to expand through collaborations with designers, celebrities, and cultural icons, blending sports performance with fashion and streetwear trends."
    },
    {
        "name": "New Balance",
        "country": "USA",
        "year_founded": 1906,
        "description": "New Balance is an American sportswear brand known for its high-quality athletic footwear, apparel, and accessories. Founded in 1906 in Boston, Massachusetts, by William J. Riley, the company originally specialized in orthopedic arch supports before transitioning into athletic shoes. New Balance is privately owned and operates under the official name New Balance Athletics, Inc.\nUnlike many competitors, New Balance emphasizes comfort, performance, and craftsmanship over flashy marketing. It's recognized for offering a wide range of shoe sizes and widths, catering to diverse foot shapes. Iconic models like the 990, 574, and 327 have gained popularity in both performance running and casual fashion, contributing to the brand’s crossover appeal between athletics and lifestyle wear.\nNew Balance maintains a strong commitment to domestic manufacturing, producing a significant portion of its shoes in the United States and the United Kingdom—a rarity in the modern sneaker industry. This focus on quality and heritage has earned the brand loyalty from athletes and fashion-conscious consumers alike.\nWhile New Balance sponsors athletes and sports teams, particularly in running, baseball, and soccer, it is less endorsement-driven than competitors like Nike or Adidas. In recent years, the brand has gained traction in streetwear and high fashion through collaborations with designers and boutique labels, further boosting its cultural relevance.."
    }
]